src/AccumulationRegisters/РасчетыНалогоплательщиковСБюджетомПоНДФЛ/РасчетыНалогоплательщиковСБюджетомПоНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыНалогоплательщиковСБюджетомПоНДФЛ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСПревышения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалогНаПрибыльДляДивидендов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоходаСКоторогоНеУдержанНалог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалогСДивидендовУплаченныйЗаРубежом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСПревышенияПоСтавке18</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСПревышенияПоСтавке20</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСПревышенияПоСтавке22</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.ТерриторияВыполненияРаботВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ДокументыОснованияНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУдержания</name>
    <type>
      <types>EnumRef.ВариантыУдержанияНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВДекларациюПоНалогуНаПрибыль</name>
    <comment>АПК:58 - различия имени и синонима вызваны обратной совместимостью</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетМежрасчетногоПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВыплаченногоДохода</name>
    <comment>АПК:58 </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПеречисления</name>
    <comment>АПК:58 </comment>
    <type>
      <types>EnumRef.СрокиПеречисляемогоНалога</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрокУплаты</name>
    <comment>АПК:58 - различия имени и синонима вызваны обратной совместимостью</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВыплаченныйДоходВ6НДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияДоходаФиксирована</name>
    <comment>АПК:58 </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстаревшаяДатаПолученияДохода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарегистрированоПриНачисленииАванса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНалогообложенияРезидента</name>
    <type>
      <types>EnumRef.НДФЛСтавкиНалогообложенияРезидента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНалоговогоПериода</name>
    <comment>АПК:58 имя сохранено ради обратной совместимости</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДохода</name>
    <comment>АПК:58 имя ВидДохода уже занято</comment>
    <type>
      <types>EnumRef.КатегорииДоходовНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрацияВНалоговомОргане</name>
    <comment>АПК:58</comment>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьКодДохода</name>
    <comment>АПК:58</comment>
    <type>
      <types>CatalogRef.УдалитьВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДохода</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/РасчетыНалогоплательщиковСБюджетомПоНДФЛ/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Регистратор = Отбор.Регистратор.Значение;
	Организация = ЭтотОбъект[0].ГоловнаяОрганизация;
	УточнятьКрайнийСрокУплаты = Ложь;
	ДатаЗакона263ФЗ = УчетНДФЛ.ДатаЗакона263ФЗ();
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если СтрокаНабора.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			Если Не ЗначениеЗаполнено(СтрокаНабора.ДокументОснование) Тогда
				СтрокаНабора.ДокументОснование = Регистратор;
			КонецЕсли;
		ИначеЕсли СтрокаНабора.ВариантУдержания = Перечисления.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей Или СтрокаНабора.ВариантУдержания = Перечисления.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган Тогда	
			Если Не ЗначениеЗаполнено(СтрокаНабора.ДокументОснование) И ТипЗнч(Регистратор) <> Тип("ДокументСсылка.ОперацияНалоговогоУчетаПоНДФЛ") Тогда
				СтрокаНабора.ДокументОснование = Регистратор;
			КонецЕсли;
		ИначеЕсли СтрокаНабора.ВариантУдержания = Перечисления.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом И СтрокаНабора.Период < ДатаЗакона263ФЗ Тогда	
			СтрокаНабора.КрайнийСрокУплаты = '00010101'
		ИначеЕсли СтрокаНабора.ВариантУдержания = Перечисления.ВариантыУдержанияНДФЛ.Удержано  Тогда	
			Если Не ЗначениеЗаполнено(СтрокаНабора.КрайнийСрокУплаты) Тогда
				УточнятьКрайнийСрокУплаты = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если УточнятьКрайнийСрокУплаты Тогда
		УчетНДФЛ.ПроставитьКрайнийСрокУплаты(ЭтотОбъект, Организация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
